Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: Plugin not loaded
fr: Le plugin n'est pas chargé
ko: 플러그인이 로드되지 않음
tr: Eklenti yüklenmedi
vi: Plugin chưa được tải
zh_hans: 插件未加载
zh_hant: 外掛未載入

source: Edit Provider
fr: Modifier le fournisseur
ko: 제공자 편집
tr: Sağlayıcıyı Düzenle
vi: Sửa nhà cung cấp
zh_hans: 编辑提供商
zh_hant: 編輯供應商

source: Disconnected from %@
fr: Déconnecté de %@
ko: %@ 연결이 해제되었습니다
tr: %@ bağlantısı kesildi
vi: Đã ngắt kết nối khỏi %@
zh_hans: 已断开与 %@ 的连接
zh_hant: 已中斷與 %@ 的連線

source: Use environment variables in connection fields.
fr: Utilisez les variables d'environnement dans les champs de connexion.
ko: 연결 필드에서 환경 변수를 사용합니다.
tr: Bağlantı alanlarında ortam değişkenlerini kullanın.
vi: Sử dụng biến môi trường trong trường kết nối.
zh_hans: 在连接字段中使用环境变量。
zh_hant: 在連線欄位中使用環境變數。

source: Typography
fr: Typographie
ko: 타이포그래피
vi: Kiểu chữ
zh_hans: 排版
zh_hant: 排版

source: Partition this one subdivides
fr: Partitionner celui-ci subdivise

source: Set to NULL
fr: Définir sur NULL
ko: NULL로 설정
tr: NULL Olarak Ayarla
vi: Đặt thành NULL
zh_hans: 设为 NULL
zh_hant: 設為 NULL

source: Other…
fr: Autre...
ko: 기타…
tr: Diğer…
vi: Khác…
zh_hans: 其他…
zh_hant: 其他…

source: Key pattern, e.g. user:*
fr: Modèle clé, par exemple utilisateur :*
ko: 키 패턴(예: user:*)
tr: Anahtar deseni, örn. user:*
vi: Mẫu khóa, ví dụ user:*
zh_hans: 键模式，例如 user:*
zh_hant: 鍵模式，例如 user:*

source: Previous page
fr: Page précédente
ko: 이전 페이지
tr: Önceki sayfa
vi: Trang trước
zh_hans: 上一页
zh_hant: 上一頁

source: NULL — no referenced row
fr: NULL - aucune ligne référencée
ko: NULL — 참조된 행 없음
tr: NULL — referans satır yok
vi: NULL — không có dòng tham chiếu
zh_hans: NULL — 无引用行
zh_hant: NULL，沒有參照的列

source: Restore Dump Cancelled
fr: Restauration de la décharge annulée
ko: 덤프 복원 취소됨
tr: Döküm Geri Yükleme İptal Edildi
vi: Đã hủy khôi phục dump
zh_hans: 转储恢复已取消
zh_hant: 還原備份已取消

source: Transaction action must be begin, commit, or rollback.
fr: L'action de la transaction doit être commencée, commise ou annulée.
ko: 트랜잭션 동작은 begin, commit 또는 rollback이어야 합니다.
tr: İşlem eylemi begin, commit ya da rollback olmalıdır.
vi: Hành động transaction phải là begin, commit hoặc rollback.
zh_hans: 事务操作必须是 begin、commit 或 rollback。
zh_hant: 交易操作必須是 begin、commit 或 rollback。

source: comma
fr: virgule
ko: 쉼표
tr: virgül
vi: dấu phẩy
zh_hans: 逗号
zh_hant: 逗號

source: No Matches
fr: Aucun résultat

source: Failed to save template: %@
fr: Échec de l'enregistrement du modèle : %@
ko: 템플릿을 저장하지 못했습니다: %@
tr: Şablon kaydedilemedi: %@
vi: Lưu mẫu thất bại: %@
zh_hans: 保存模板失败: %@
zh_hant: 儲存範本失敗：%@

source: Remove…
fr: Supprimer...

source: Unsaved changes will be lost.
fr: Les modifications non enregistrées seront perdues.
ko: 저장하지 않은 변경 사항이 사라집니다.
tr: Kaydedilmemiş değişiklikler kaybolacak.
vi: Các thay đổi chưa lưu sẽ bị mất.
zh_hans: 未保存的更改将会丢失。
zh_hant: 未儲存的變更將會遺失。

source: %@ cannot restore a deleted row with its original key.
fr: %@ ne peut pas restaurer une ligne supprimée avec sa clé originale.
ko: %@은(는) 삭제된 행을 원래 키로 복원할 수 없습니다.
tr: %@, silinmiş bir satırı özgün anahtarıyla geri yükleyemiyor.
vi: %@ không thể khôi phục dòng đã xoá với khoá gốc của nó.
zh_hans: %@ 无法用原来的键恢复已删除的行。
zh_hant: %@ 無法用原來的鍵還原已刪除的列。

source: Table: %@
fr: Tableau : %@
ko: 테이블: %@
tr: tablo: %@
vi: Bảng: %@
zh_hans: 表：%@
zh_hant: 資料表：%@

source: Pro License Required
fr: Licence professionnelle requise
ko: Pro 라이선스 필요
tr: Pro Lisans Gerekli
vi: Yêu cầu giấy phép Pro
zh_hans: 需要 Pro 许可证
zh_hant: 需要 Pro 授權

source: Settings were changed
fr: Les paramètres ont été modifiés
ko: 설정이 변경되었습니다
vi: Cài đặt đã bị thay đổi
zh_hans: 设置已更改
zh_hant: 設定已變更

source: Select a file to import
fr: Sélectionnez un fichier à importer

source: Never used
fr: Jamais utilisé
ko: 사용한 적 없음
tr: Hiç kullanılmadı
vi: Chưa dùng bao giờ
zh_hans: 从未使用
zh_hant: 從未使用

source: Partition bound as the engine spells it
fr: Partition liée comme l'indique le moteur.

source: Smart value detection
fr: Détection intelligente de la valeur
ko: 스마트 값 감지
tr: Akıllı değer algılama
vi: Nhận dạng giá trị thông minh
zh_hans: 智能值识别
zh_hant: 智慧值偵測

source: Show Previous Workspace
fr: Afficher l'espace de travail précédent
ko: 이전 작업 공간 보기
tr: Önceki Çalışma Alanını Göster
vi: Hiện không gian làm việc trước
zh_hans: 显示上一个工作区
zh_hant: 顯示上一個工作區

source: Backup Dump Finished With Problems
fr: Le sauvegarde Dump a été terminé avec des problèmes.

source: Unassigned
fr: Non affecté
ko: 미지정
tr: Atanmamış
vi: Chưa gán
zh_hans: 未分配
zh_hant: 未指派

source: This folder is already linked
fr: Ce dossier est déjà lié.
ko: 이 폴더는 이미 연결되어 있습니다
tr: Bu klasör zaten bağlı
vi: Thư mục này đã được liên kết
zh_hans: 此文件夹已关联
zh_hant: 此資料夾已連結

source: Will not change
fr: Ne changera pas
ko: 변경되지 않습니다
tr: Değişmeyecek
vi: Sẽ không thay đổi
zh_hans: 不会更改
zh_hant: 不會變更

source: A column left out of the comparison is still written on insert and update. Changing either list needs another comparison.
fr: Une colonne manquante dans la comparaison est toujours écrite sur l'insérer et la mettre à jour. Le changement de l'une des listes nécessite une autre comparaison.
ko: 비교에서 제외한 열도 삽입과 업데이트에는 그대로 기록됩니다. 두 목록 중 하나를 바꾸면 다시 비교해야 합니다.
tr: Karşılaştırmanın dışında bırakılan bir sütun, ekleme ve güncellemede yine de yazılır. Listelerden birini değiştirmek yeni bir karşılaştırma gerektirir.
vi: Cột bị bỏ khỏi so sánh vẫn được ghi khi chèn và cập nhật. Thay đổi một trong hai danh sách cần so sánh lại.
zh_hans: 被排除在比较之外的列，在插入和更新时仍会写入。更改任一列表都需要重新比较。
zh_hant: 被排除在比較之外的欄位，在插入和更新時仍會寫入。變更任一清單都需要重新比較。

source: %1$d of %2$d
fr: %1$d de %2$d
ko: %1$d/%2$d
tr: %2$d içinden %1$d
vi: %1$d trên %2$d
zh_hans: %1$d / %2$d
zh_hant: %1$d / %2$d

source: Close Session
fr: Fermer la session

source: Nested field path
fr: Chemin de champ imbriqué
ko: 중첩된 필드 경로
tr: İç içe alan yolu
vi: Đường dẫn trường lồng nhau
zh_hans: 嵌套字段路径
zh_hant: 巢狀欄位路徑

source: Click + to create your first connection
fr: Cliquez + pour créer votre première connexion.
ko: +를 클릭하여 첫 번째 연결을 만드십시오
tr: İlk bağlantınızı oluşturmak için + tıklayın
vi: Nhấn + để tạo kết nối đầu tiên
zh_hans: 点击 + 创建您的第一个连接
zh_hant: 點按 + 以建立你的第一個連線

source: New database
fr: Nouvelle base de données

source: Failed to load
fr: Impossible de charger
ko: 불러오지 못했습니다
tr: Yüklenemedi
vi: Tải thất bại
zh_hans: 加载失败
zh_hant: 載入失敗

source: Tertiary Text
fr: Texte tertiaire
ko: 3차 텍스트
tr: Üçüncül Metin
vi: Văn bản thứ ba
zh_hans: 辅助文本
zh_hant: 第三層文字

source: Update or reinstall the plugin in Settings > Plugins.
fr: Mettez à jour ou réinstallez le plugin dans Paramètres > Plugins.

source: Output of EXPLAIN for this query, if you have it
fr: Sortie d'EXPLAIN pour cette requête, si vous l'avez.
ko: 이 쿼리에 대한 EXPLAIN 출력이며, 있는 경우에 한합니다
tr: Varsa bu sorgu için EXPLAIN çıktısı
vi: Kết quả EXPLAIN của truy vấn này, nếu bạn có
zh_hans: 该查询的 EXPLAIN 输出，如果你有的话
zh_hant: 該查詢的 EXPLAIN 輸出，如果你有的話

source: FULL (rewrites entire table, blocks access)
fr: COMPLET (réécrit toute la table, bloque l'accès)
ko: FULL(전체 테이블을 다시 쓰며 접근을 차단함)
tr: FULL (tüm tabloyu yeniden yazar, erişimi engeller)
vi: FULL (ghi lại toàn bộ bảng, chặn truy cập)
zh_hans: FULL（重写整个表，阻止访问）
zh_hant: FULL(重寫整個資料表,封鎖存取)

source: Page Size
fr: Taille de la page
ko: 페이지 크기
tr: Sayfa Boyutu
vi: Kích thước trang
zh_hans: 页面大小
zh_hant: 頁面大小

source: The query returned no rows.
fr: La requête n'a pas renvoyé de lignes.

source: On %@ this is a key of the table, not an index.
fr: Sur %@ il s'agit d'une clé de la table, pas d'un index.

source: Table the trigger fires for
fr: Tableau des déclenchements qui déclenchent pour
ko: 트리거가 실행되는 대상 테이블
tr: Tetikleyicinin çalıştığı tablo
vi: Bảng mà trigger kích hoạt cho
zh_hans: 该触发器针对的表
zh_hant: 該觸發器針對的資料表

source: Separator (optional)
fr: Séparateur (facultatif)
ko: 구분 기호(선택 사항)
tr: Ayırıcı (isteğe bağlı)
vi: Dấu phân cách (tùy chọn)
zh_hans: 分隔符（可选）
zh_hant: 分隔符號（選填）

source: Import from DDL
fr: Importer depuis DDL
ko: DDL에서 가져오기
tr: DDL'den İçe Aktar
vi: Nhập từ DDL
zh_hans: 从 DDL 导入
zh_hant: 從 DDL 匯入

source: Disable foreign key checks
fr: Désactiver les vérifications des clés étrangères
ko: 외래 키 검사 비활성화
tr: Yabancı anahtar kontrollerini kapat
vi: Tắt kiểm tra khóa ngoại
zh_hans: 禁用外键检查
zh_hant: 停用外鍵檢查

source: Release the Server Connection After (minutes, 0 to keep it)
fr: Libérer la connexion au serveur après (minutes, 0 pour la garder)

source: Copy Privileges
fr: Privilèges de copie
ko: 권한 복사
tr: Yetkileri Kopyala
vi: Sao chép quyền
zh_hans: 复制权限
zh_hant: 複製權限

source: Has Differences
fr: A des différences
ko: 차이 있음
tr: Fark Var
vi: Có khác biệt
zh_hans: 存在差异
zh_hant: 存在差異

source: The encrypted file is corrupt or incomplete
fr: Le fichier crypté est corrompu ou incomplett.
ko: 암호화된 파일이 손상되었거나 불완전합니다
tr: Şifreli dosya bozuk veya eksik
vi: Tệp mã hóa bị hỏng hoặc không đầy đủ
zh_hans: 加密文件已损坏或不完整
zh_hant: 加密的檔案已損毀或不完整

source: External
fr: Externe
ko: 외부
tr: Harici
vi: Bên ngoài
zh_hans: 外部
zh_hant: 外部

source: Close
fr: Fermer
ko: 닫기
tr: Kapat
vi: Đóng
zh_hans: 关闭
zh_hant: 關閉

source: Write a query that answers a question, using the real columns of the named tables
fr: Écrivez une requête qui répond à une question, en utilisant les colonnes réelles des tables nommées.
ko: 지정한 테이블의 실제 열을 사용해 질문에 답하는 쿼리를 작성합니다
tr: Adı verilen tabloların gerçek sütunlarını kullanarak bir soruyu yanıtlayan bir sorgu yazar
vi: Viết một truy vấn trả lời câu hỏi, dùng đúng các cột thật của những bảng được nêu tên
zh_hans: 使用所指定表的真实列，写出一个回答该问题的查询
zh_hant: 使用所指定資料表的真實欄位，寫出一個回答該問題的查詢

source: The plan shape changed
fr: La forme du plan a changé
ko: 플랜 구조가 변경됨
tr: Plan yapısı değişti
vi: Cấu trúc kế hoạch đã thay đổi
zh_hans: 计划结构已改变
zh_hant: 計劃結構已改變

source: No Comparison Yet
fr: Pas de comparaison encore
ko: 아직 비교하지 않음
tr: Henüz Karşılaştırma Yok
vi: Chưa có so sánh
zh_hans: 尚无比较
zh_hant: 尚無比較

source: Not installed
fr: Non installé
ko: 설치되지 않음
tr: Yüklü değil
vi: Chưa cài đặt
zh_hans: 未安装
zh_hant: 未安裝

source: Switch to Least Recent Tab
fr: Passer à l'onglet le moins récent
ko: 가장 오래전에 사용한 탭으로 전환
tr: En Eski Kullanılan Sekmeye Geç
vi: Chuyển đến tab dùng lâu nhất
zh_hans: 切换到最久未用的标签页
zh_hant: 切換到最久未用的分頁

source: Database name (uses current if omitted)
fr: Nom de la base de données (utilise la version actuelle si omise)
ko: 데이터베이스 이름(생략하면 현재 데이터베이스 사용)
tr: Veritabanı adı (boş bırakılırsa geçerli olan kullanılır)
vi: Tên cơ sở dữ liệu (nếu bỏ trống sẽ dùng cơ sở dữ liệu hiện tại)
zh_hans: 数据库名称（留空时使用当前数据库）
zh_hant: 資料庫名稱（留空時使用目前的資料庫）

source: Color %@
fr: Couleur %@
ko: 색상 %@
tr: Renk %@
vi: Màu %@
zh_hans: 颜色 %@
zh_hant: 顏色 %@

source: Settings
fr: Paramètres
ko: 설정
tr: Ayarlar
vi: Cài đặt
zh_hans: 设置
zh_hant: 設定

source: Remove Provider
fr: Supprimer le fournisseur
ko: 제공자 제거
tr: Sağlayıcıyı Kaldır
vi: Gỡ nhà cung cấp
zh_hans: 移除提供方
zh_hant: 移除供應商

source: Skipped %@: TablePro has no driver for that engine.
fr: Évité %@ : TablePro n'a pas de pilote pour ce moteur.

source: Keep saved changes for restoring
fr: Gardez les modifications enregistrées pour les restaurer.
ko: 복원을 위해 저장된 변경 사항 유지
tr: Geri yükleme için kaydedilen değişiklikleri sakla
vi: Giữ lại các thay đổi đã lưu để khôi phục
zh_hans: 保留已保存的更改以便恢复
zh_hant: 保留已儲存的變更以便還原

source: Query executed successfully
fr: La requête a été exécutée avec succès
ko: 쿼리가 성공적으로 실행되었습니다
tr: Sorgu başarıyla çalıştırıldı
vi: Truy vấn thực thi thành công
zh_hans: 查询执行成功
zh_hant: 查詢執行成功

source: Drop Failed
fr: Dépose échouée
ko: 삭제 실패
tr: Silme Başarısız
vi: Xóa thất bại
zh_hans: 删除失败
zh_hant: 捨棄失敗

source: Broker Addresses
fr: Adresses des courtiers
ko: 브로커 주소
tr: Broker Adresleri
vi: Địa chỉ broker
zh_hans: Broker 地址
zh_hant: Broker 位址

source: Element %d
fr: Élément %d

source: Saves already committed stay committed. You will not be able to restore their previous values.
fr: Enregistre un séjour déjà engagé, restez engagé. Vous ne pourrez pas restaurer leurs valeurs précédentes.
ko: 이미 커밋된 저장은 그대로 유지됩니다. 이전 값을 복원할 수 없게 됩니다.
tr: Zaten işlenmiş kayıtlar işlenmiş kalır. Önceki değerlerini geri yükleyemezsiniz.
vi: Các lần lưu đã commit vẫn giữ nguyên. Bạn sẽ không thể khôi phục giá trị trước đó của chúng.
zh_hans: 已提交的保存仍然保持提交状态。你将无法恢复它们之前的值。
zh_hant: 已提交的儲存仍然保持提交狀態。你將無法還原它們先前的值。

source: Delete SSH Profile?
fr: Supprimer le profil SSH ?
ko: SSH 프로필을 삭제하시겠습니까?
tr: SSH Profili Silinsin mi?
vi: Xoá hồ sơ SSH?
zh_hans: 删除 SSH 配置？
zh_hant: 刪除 SSH 設定檔？

source: Stop allowing explicit identity values in %@
fr: Arrêtez d'autoriser des valeurs d'identité explicites dans %@

source: Loading schemas…
fr: Chargement des schémas...
ko: 스키마 불러오는 중…
tr: Şemalar yükleniyor…
vi: Đang tải schema…
zh_hans: 正在载入 Schema…
zh_hant: 正在載入綱要…

# An external link wants to open a query on "%@": %@
source: An external link wants to open a query on "%1$@": %2$@
fr: Un lien externe veut ouvrir une requête sur "%1$@" : %2$@
ko: 외부 링크에서 "%1$@"의 쿼리를 열려고 합니다: %2$@
tr: Harici bir bağlantı "%@" üzerinde bir sorgu açmak istiyor: %@
vi: Một liên kết bên ngoài muốn mở truy vấn trên "%@": %@
zh_hans: 外部链接希望在 "%@" 上打开查询： %@
zh_hant: 有外部連結想要在「%1$@」上開啟查詢： %2$@

source: %@ mapped more than once
fr: %@ cartographié plus d'une fois

source: A filter cannot contain a comment.
fr: Un filtre ne peut pas contenir un commentaire.

source: Warning
fr: Avertissement
ko: 경고
tr: Uyarı
vi: Cảnh báo
zh_hans: 警告
zh_hant: 警告

source: %@ files cannot be imported into this connection.
fr: Les fichiers %@ ne peuvent pas être importés dans cette connexion.

source: Not backed up
fr: Pas sauvegardé

source: %@ Preview tab. Double-click to keep it open.
fr: %@ Onglet d’aperçu. Double-cliquez pour le laisser ouvert.
ko: %@ 미리보기 탭입니다. 계속 열어 두려면 두 번 클릭하십시오.
tr: %@ Önizleme sekmesi. Açık tutmak için çift tıklayın.
vi: %@ Tab xem trước. Nhấp đúp để giữ tab mở.
zh_hans: %@ 预览标签页。双击可保持打开。
zh_hant: %@ 預覽標籤頁。連按兩下可保持開啟。

source: %@, finished
fr: %@, terminé
ko: %@, 완료됨
tr: %@, bitti
vi: %@, đã xong
zh_hans: %@，已完成
zh_hant: %@，已完成

source: Namespace
fr: Espace de noms
ko: 네임스페이스
zh_hans: 命名空间
zh_hant: 命名空間

source: Default
fr: Par défaut
ko: 기본값
tr: Varsayılan
vi: Mặc định
zh_hans: 默认
zh_hant: 預設

source: Publish %d Connections to Team Catalog…
fr: Publier %d connexions au catalogue de l'équipe...
ko: %d개 연결을 팀 카탈로그에 게시…
tr: %d Bağlantıyı Takım Kataloğuna Yayınla…
vi: Xuất bản %d kết nối lên danh mục nhóm…
zh_hans: 将 %d 个连接发布到团队目录…
zh_hant: 將 %d 個連線發佈到團隊目錄…

# %@ to %@ characters
source: %1$@ to %2$@ characters
fr: %1$@ à %2$@ caractères

source: Add Linked SQL Folder…
fr: Ajouter le dossier SQL lié...
ko: 연결된 SQL 폴더 추가…
tr: Bağlı SQL Klasörü Ekle…
vi: Thêm thư mục SQL liên kết…
zh_hans: 添加关联 SQL 文件夹…
zh_hant: 加入連結的 SQL 資料夾…

source: SQL Server
fr: Serveur SQL

source: Hide token
fr: Cacher le jeton
ko: 토큰 가리기
tr: Token gizle
vi: Ẩn token
zh_hans: 隐藏令牌
zh_hant: 隱藏權杖

source: One element per row. Use where a parser expects XML.
fr: Un élément par ligne. Utilisez-le là où un analyseur attend XML.

source: List foreign keys for one table, or for the whole schema when 'table' is omitted, so joins can be written from the real relationships rather than guessed from column names.
fr: Listez les clés étrangères pour une table ou pour l'ensemble du schéma lorsque 'table' est omise, afin que les joins puissent être écrits à partir des relations réelles plutôt que d'être devinées à partir des noms des colonnes.
ko: 한 테이블의 외래 키를 나열하며, 'table'을 생략하면 스키마 전체를 나열합니다. 열 이름으로 추측하지 않고 실제 관계를 보고 조인을 작성할 수 있습니다.
tr: Bir tablonun, 'table' verilmediğinde ise şemanın tamamının yabancı anahtarlarını listeler; böylece birleştirmeler sütun adlarından tahmin edilmek yerine gerçek ilişkilerden yazılabilir.
vi: Liệt kê khoá ngoại của một bảng, hoặc của cả schema khi bỏ trống 'table', để viết join dựa trên quan hệ thật thay vì đoán từ tên cột.
zh_hans: 列出一张表的外键，或者在省略 'table' 时列出整个 Schema 的外键，这样 JOIN 可以依据真实关系来写，而不是从列名猜测。
zh_hant: 列出一張資料表的外鍵，或者在省略 'table' 時列出整個綱要的外鍵，這樣 JOIN 可以依據真實關聯來寫，而不是從欄位名稱猜測。

source: Replace with
fr: Remplacer par

source: Integrations: Starting...
fr: Intégrations : Commencez...
ko: 통합: 시작 중...
tr: Entegrasyonlar: Başlatılıyor...
vi: Tích hợp: Đang khởi động...
zh_hans: 集成：启动中…
zh_hant: 整合：啟動中…

source: TablePro is still trying to reconnect.
fr: TablePro essaie toujours de se reconnecter.
ko: TablePro가 아직 다시 연결을 시도하고 있습니다.
tr: TablePro hâlâ yeniden bağlanmaya çalışıyor.
vi: TablePro vẫn đang thử kết nối lại.
zh_hans: TablePro 仍在尝试重新连接。
zh_hant: TablePro 仍在嘗試重新連線。

source: Restrict to one kind. Omit for both.
fr: Restreindre à une seule espèce. Omettre pour les deux.
ko: 한 종류로 제한합니다. 둘 다 보려면 생략하십시오.
tr: Tek bir türle sınırlar. İkisi için de boş bırakın.
vi: Giới hạn trong một loại. Bỏ trống để lấy cả hai.
zh_hans: 限定为一种。省略则表示两种都要。
zh_hant: 限定為一種。省略則表示兩種都要。

source: The dump is copied into this database, and the change cannot be undone. If an object it holds already exists, the restore stops before copying anything.
fr: Le déchet est copié dans cette base de données, et le changement ne peut pas être annulé. Si un objet qu'il contient existe déjà, la restauration s'arrête avant de copier quoi que ce soit.

source: Current statement
fr: Déclaration actuelle
ko: 현재 명령문
tr: Geçerli ifade
vi: Câu lệnh hiện tại
zh_hans: 当前语句
zh_hant: 目前陳述式

source: Open a connection to insert
fr: Ouvrez une connexion pour insérer
ko: 삽입할 연결 열기
tr: Eklemek için bir bağlantı açın
vi: Mở một kết nối để chèn
zh_hans: 打开一个连接以插入
zh_hant: 開啟一個連線以插入

source: Autocomplete from your schema, editor tabs, and a searchable query history.
fr: Complétion automatique à partir de votre schéma, des onglets de l'éditeur et d'un historique de requêtes consultables.
ko: 스키마 기반 자동 완성, 편집기 탭, 검색 가능한 쿼리 기록을 제공합니다.
tr: Şemanızdan otomatik tamamlama, düzenleyici sekmeleri ve aranabilir sorgu geçmişi.
vi: Tự động hoàn thành theo lược đồ, các tab trình soạn thảo và lịch sử truy vấn có thể tìm kiếm.
zh_hans: 基于架构的自动补全、编辑器标签页和可搜索的查询历史。
zh_hant: 依結構描述自動完成、編輯器標籤頁與可搜尋的查詢記錄。

source: Zoom Out
fr: Dézoomer
ko: 축소
tr: Uzaklaştır
vi: Thu nhỏ
zh_hans: 缩小
zh_hant: 縮小

source: Integrations Activity
fr: Activité d'intégration
ko: 통합 활동
tr: Entegrasyon Etkinliği
vi: Hoạt động tích hợp
zh_hans: 集成活动
zh_hant: 整合活動

source: Host: %@
fr: Hôte : %@
ko: 호스트: %@
tr: Sunucu: %@
vi: Máy chủ: %@
zh_hans: 主机：%@
zh_hant: 主機：%@

source: Procedure
fr: Procédure
ko: 프로시저
tr: Prosedür
zh_hans: 存储过程
zh_hant: 預存程序

source: Click "+ Add new global MCP server"
fr: Cliquez sur "+ Ajouter un nouveau serveur MCP global"
ko: "+ Add new global MCP server"를 클릭하십시오
tr: "+ Add new global MCP server" tıklayın
vi: Nhấn "+ Add new global MCP server"
zh_hans: 点击 "+ Add new global MCP server"
zh_hant: 點按「+ Add new global MCP server」

source: Installation Failed
fr: Installation échouée
ko: 설치 실패
tr: Yükleme Başarısız
vi: Cài đặt thất bại
zh_hans: 安装失败
zh_hant: 安裝失敗

source: Activity Details
fr: Détails de l'activité
ko: 활동 세부사항
tr: Etkinlik ayrıntıları
vi: Chi tiết hoạt động
zh_hans: 活动详情
zh_hant: 活動詳細資訊

source: Creating Backup Dump
fr: Création d'un décompte de sau
ko: 백업 덤프 생성 중
tr: Yedek Dökümü Oluşturuluyor
vi: Đang tạo bản dump sao lưu
zh_hans: 正在创建备份转储
zh_hant: 正在建立資料庫備份

source: Pretty print (formatted output)
fr: Impression jolie (sortie formatée)
ko: 보기 좋게 출력(서식이 지정된 출력)
vi: In đẹp (đầu ra có định dạng)
zh_hans: 格式化输出（带格式）
zh_hant: 美化輸出（格式化輸出）

source: statements
fr: Déclarations
ko: 문
vi: câu lệnh
zh_hans: 条语句
zh_hant: 陳述式

source: The target returned a body rather than a statement that recreates it.
fr: La cible a renvoyé un corps plutôt qu'une déclaration qui le recrée.

source: Open Zed and click the Agent Panel icon in the right side of the title bar
fr: Ouvrez Zed et cliquez sur l'icône du panneau d'agent sur le côté droit de la barre de titre.
ko: Zed를 열고 제목 막대 오른쪽의 에이전트 패널 아이콘을 클릭하십시오
tr: Zed'i açın ve başlık çubuğunun sağındaki Agent Panel simgesine tıklayın
vi: Mở Zed và nhấp vào biểu tượng Agent Panel ở bên phải thanh tiêu đề
zh_hans: 打开 Zed，点按标题栏右侧的 Agent Panel 图标
zh_hant: 開啟 Zed，點按標題列右側的 Agent Panel 圖示

source: AI Not Configured
fr: IA non configurée
ko: AI가 설정되지 않음
tr: AI Yapılandırılmadı
vi: AI chưa được cấu hình
zh_hans: AI 未配置
zh_hant: AI 尚未設定

source: Created the database %@.
fr: Créé la base de données %@.

source: Alert (Full)
fr: Alerte (pleine)
ko: 알림(전체)
tr: Uyarı (Tam)
vi: Cảnh báo (Đầy đủ)
zh_hans: 警告（完整）
zh_hant: 警示（完整）

source: %@ was not found.
fr: %@ n'a pas été trouvé.

source: Maximum entries to return (1-500, default 50)
fr: Nombre maximum d'entrées à retourner (1-500, par défaut 50)
ko: 반환할 최대 항목 수(1~500, 기본값 50)
tr: Döndürülecek en fazla girdi (1-500, varsayılan 50)
vi: Số mục tối đa trả về (1-500, mặc định 50)
zh_hans: 最多返回多少条目（1-500，默认 50）
zh_hant: 最多回傳多少項目（1-500，預設 50）

source: Open Quickly…
fr: Ouvrir rapidement...
ko: 빠르게 열기…
tr: Hızlı Aç…
vi: Mở nhanh…
zh_hans: 快速打开…
zh_hant: 快速打開…

source: The connection was closed and reconnecting was cancelled.
fr: La connexion a été fermée et la réinitialisation a été annulée.
ko: 연결이 닫혔고 재연결이 취소되었습니다.
tr: Bağlantı kapatıldı ve yeniden bağlanma iptal edildi.
vi: Kết nối đã bị đóng và việc kết nối lại đã bị huỷ.
zh_hans: 连接已关闭，重新连接已取消。
zh_hant: 連線已關閉，重新連線已取消。

source: Search or type…
fr: Rechercher ou taper...
ko: 검색 또는 입력…
tr: Arayın veya yazın…
vi: Tìm kiếm hoặc nhập…
zh_hans: 搜索或输入…
zh_hant: 搜尋或輸入…

source: Allow remote connections
fr: Autoriser les connexions à distance
ko: 원격 연결 허용
tr: Uzak bağlantılara izin ver
vi: Cho phép kết nối từ xa
zh_hans: 允许远程连接
zh_hant: 允許遠端連線

source: Compare/Sync with…
fr: Comparer/Synchroniser avec...
ko: 다음과 비교/동기화…
tr: Şununla Karşılaştır/Eşitle…
vi: So sánh/Đồng bộ với…
zh_hans: 与之比较/同步…
zh_hant: 與之比較/同步…

source: Engine-specific column attributes
fr: Attributs de colonne spécifiques au moteur
ko: 엔진별 열 속성
tr: Motora özgü sütun öznitelikleri
vi: Thuộc tính cột riêng của engine
zh_hans: 引擎特有的列属性
zh_hant: 引擎特有的欄位屬性

source: Hidden
fr: Caché

source: %@ (hidden)
fr: %@ (masqué)

source: No Schemas
fr: Pas de schémas
ko: 스키마 없음
tr: Şema Yok
vi: Không có schema
zh_hans: 没有 Schema
zh_hant: 沒有綱要

source: PHP Viewer
fr: Visualiseur PHP
ko: PHP 뷰어
tr: PHP Görüntüleyici
vi: Trình xem PHP
zh_hans: PHP 查看器
zh_hant: PHP 檢視器

source: Add Filter (Cmd+Shift+F)
fr: Ajouter un filtre (Cmd+Shift+F)
ko: 필터 추가(Cmd+Shift+F)
tr: Filtre Ekle (Cmd+Shift+F)
vi: Thêm bộ lọc (Cmd+Shift+F)
zh_hans: 添加筛选 (Cmd+Shift+F)
zh_hant: 新增篩選 (Cmd+Shift+F)

source: Choose a query from the list to see its full content here.
fr: Choisissez une requête dans la liste Pour voir son contenu complet ici.
ko: 목록에서 쿼리를 선택하면 여기에 전체 내용이 표시됩니다.
tr: Tam içeriğini burada görmek için listeden bir sorgu seçin.
vi: Chọn một truy vấn từ danh sách để xem nội dung đầy đủ tại đây.
zh_hans: 从列表中选择一个查询 以在此处查看其完整内容。
zh_hant: 從清單中選擇一個查詢 以在此處查看其完整內容。

source: That tab no longer has a window.
fr: Cette onglet n'a plus de fenêtre.
ko: 해당 탭에는 더 이상 창이 없습니다.
tr: Bu sekmenin artık bir penceresi yok.
vi: Tab đó không còn cửa sổ nào.
zh_hans: 该标签页已没有窗口。
zh_hant: 該標籤頁已沒有視窗。

source: Include this table and compare again to see its rows.
fr: Incluez cette table et comparez à nouveau pour voir ses lignes.
ko: 행을 보려면 이 테이블을 포함하고 다시 비교하십시오.
tr: Satırlarını görmek için bu tabloyu dahil edin ve yeniden karşılaştırın.
vi: Hãy bao gồm bảng này rồi so sánh lại để xem các dòng của nó.
zh_hans: 包含此表并重新比较，即可查看它的行。
zh_hant: 納入此資料表並重新比較，即可查看它的列。

source: Enum Type
fr: Type d'énumération

source: Base URL
fr: URL de base

source: Cursor
fr: Curseur
tr: İmleç
vi: Con trỏ
zh_hans: 光标
zh_hant: 游標

source: the Agent Socket setting
fr: La configuration du socket de l'agent

source: No available local port for the Cloud SQL Auth Proxy.
fr: Pas de port local disponible pour le Cloud SQL Auth Proxy.
ko: Cloud SQL Auth Proxy에 사용할 수 있는 로컬 포트가 없습니다.
tr: Cloud SQL Auth Proxy için uygun bir yerel port yok.
vi: Không còn cổng cục bộ trống cho Cloud SQL Auth Proxy.
zh_hans: 没有可用于 Cloud SQL Auth Proxy 的本地端口。
zh_hant: 沒有可供 Cloud SQL Auth Proxy 使用的本機連接埠。

source: Synced
fr: Synchronisé
ko: 동기화됨
vi: Đã đồng bộ
zh_hans: 已同步
zh_hant: 已同步
